{
    "experience": [
        {
            "company": "Amazon.com, Inc.",
            "location": "Washington, D.C.",
            "role": "Software Development Engineer",
            "start": "Jun 2020",
            "end": "Sep 2020",
            "responsibilities": [
                "Developed canary test package for Resource Access Manager (RAM) team, using Python and Ruby scripts to run tests of services across regions.",
                "Utilized Amazon Web Services (AWS) &mdash; e.g. CloudFormation, Lambda, IAM &mdash; to develop native AWS software.",
                "Designed test structure using class inheritance to ease process of writing canary tests when onboarding new AWS services and resources to RAM.",
                "Automated process of cutting and tickets and rolling back code changes when canary tests report failures."
            ]
        },
        {
            "company": "Northwestern University",
            "location": "Farley Center for Entrepreneurship and Innovation, NUvention &mdash; Web & Media",
            "role": "Software Developer",
            "start": "Jan 2020",
            "end": "Jun 2020",
            "responsibilities": [
                "Designed website to bring attention to Chicago's local music scene and constructed front-end user interface for course project using ReactJS.",
                "Conducted interviews with Chicagoans to gauge interest and problem areas for project.",
                "Integrated website with remote database, storage, and hosting using Google Firebase.",
                "Worked using agile model with a team of five to plan sprints and determine immediate and long term goals."
            ]
        },
        {
            "company": "Partners HealthCare",
            "location": "Boston, MA",
            "role": "Web Development Intern",
            "start": "Jun 2018",
            "end": "Aug 2018",
            "responsibilities": [
                "Built, maintained, updated websites for internal use and technical support within the Partners network using Drupal and SharePoint web editors as well as HTML, CSS, JavaScript, and PHP.",
                "Developed custom PHP modules and refined search engine for website using Linux.",
                "Designed posters, pamphlets, presentation materials, and other internal documents using the Adobe Creative Suite to advertise available applications and resources to clinical researchers.",
                "Communicated with team of roughly 50 employees to gather input and complete projects for department."
            ]
        }
    ],
    "skills": [
        {
            "category": "Programming",
            "examples": "C(++), Java, JavaScript, Python, Ruby, Racket"
        },
        {
            "category": "Data Management",
            "examples": "Excel, Firebase, Python, R, SQL"
        },
        {
            "category": "Web Development",
            "examples": "CSS, HTML, JavaScript (jQuery, React), PHP"
        },
        {
            "category": "Cloud Computing",
            "examples": "Amazon Web Services"
        },
        {
            "category": "Design",
            "examples": "Adobe Creative Suite (Illustrator, InDesign, Photoshop)"
        },
        {
            "category": "Software",
            "examples": "Microsoft Office (Word, PowerPoint, Excel), Google Analytics"
        },
        {
            "category": "Languages",
            "examples": "English (Native), French (Proficient)"
        }
    ]
}